Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltThreadInMaterialEnum Enumeration
 The thread in the material.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltThreadInMaterialEnum
Public Enumeration BoltThreadInMaterialEnum
Members
Member name | Value | Description
THREAD_IN_MATERIAL_NO | 0 |  No thread inside the material (the part).
THREAD_IN_MATERIAL_YES | 1 |  Thread inside the material (the part).
See Also
Reference
Tekla.Structures.Model Namespace